[
    {
        "_id": {
            "$oid": "64007eda1ffd7ad6cb625517"
        },
        "id": "24ae5013e83ef5dd",
        "title": "مثال معماری میکروسرویس",
        "content": [
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "معماری میکروسرویس تعریف های زیادی داره که یکیش تقسیم یک برنامه بزرگ به  چند برنامه هماهنگ با هم و یکپارچه هست. نمونه کدی رو نوشتم که میتونه یک  مثال خوب برای این تعریف باشه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "6d21edf3",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "سناریو",
                "id": "c932697d",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "کاری که این سیستم انجام میده اینه که یک سری محصول یا product رو میگیره ، ذخیره میکنه و موجودی خودشو نشون میده.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "به ساده ترین شکل ممکن نوشته شده و از اضافه کردن role و احراز هویت و این صحبت ها هم به دلیل حفظ سادگی و تسریع زمان صرف نظر شده.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "نمونه  کدی که نوشتم تحت فریم ورک nestjs ایجاد شده. یعنی از حالت های کلاسیک و  عادی فاصله داره و ساختار مربوط به خودشو داره. تو این کد سعی کردم بیشتر  معماری میکروسرویس رو براساس ساختار nestjs توضیح بدم. ",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "5e18df7e",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "توضیح ساختار",
                "id": "bb3283a9",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "برای درک این مثال ، نیاز هست که شما با نرم افزار Kafka و فریم ورک nestjs آشنایی داشته باشید.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "توی این مثال هم از redis هم استفاده شده که اگر آشنایی ندارید میشه از داخل همین مثال هم متوجه اون شد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "برای پایگاه داده های این مثال هم از mongodb استفاده شده.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "بستر  اجرای مثال هم با docker پیاده سازی شده که کار کردن با اون به هیچ وجه  سخت نیست. هرچند میشه بدون docker هم این مثال رو اجرا کرد اما استفاده از  docker خیلی مهم شده و تقریبا اکثر نرم افزار ها برای پیشتیبانی و مدیریت  بهتر منابع سرور ها با docker اجرا میشن.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "20e0d6ea",
                "type": "caption"
            },
            {
                "richtext": [],
                "url": "http://localhost:31375/photo/818cce0145fceee77e5d2397cca0135b.png",
                "id": "7d6ce261",
                "type": "photo"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "میکروسرویس های این سیستم با استفاده از فریمورک nestjs ساخته شده. این  میکروسرویس ها هرکدوم عهده دار یک ویژگی هستن. هرکدوم ازین میکروسرویس ها  رو جداگانه معرفی میکنم و توضیح میدم.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "b5969dac",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "Rest Api Gate (دریافت کننده اصلی)",
                "id": "911853b1",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "البته از دیدگاه فریمورک nestjs یک nest  server application بحساب میاد. کار این قسمت که حالا میکروسرویس باشه یا  نباشه اینه که داده دریافت میکنه و به اقتضای نوع داده و محل دریافت داده  اونو برای میکروسرویس مربوط ارسال میکنه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "هر میکروسرویس توی این  دریافت کننده اصطلاحا نمایندگی داره. ینی توی کنترلر اصلی ، جایی که سرور  پیام دریافت میکنه فوری برای میکروسرویس مربوط بهش ارسال میشه و جواب هم  بدون هیچ تغییر از سمت سرور برگردونده میشه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "البته ممکنه احراز هویتی  اگر بخاد وجود داشته باشه توی همین قسمت اتفاق میوفته ، اما ، اعتبارسنجی  داده های ورودی که توی همین مثال هست هم توی سرور انجام میشه که اطمینان  باشه که سرور داره داده درست و معتبر به میکروسرویس میفرسته.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "ee4e0812",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "Writer Service (سرویس نویسنده)",
                "id": "bd11c9e8",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "کار این سرویس فقط همینه که داده ای که سرور  دریافت کرده و براش فرستاده رو توی پایگاه داده ی مشترک ذخیره کنه. این  داده هم توی پایگاه داده ذخیره میشه و هم به صورت خلاصه توی redis ذخیره  میشه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "دلیل اینکه چرا از redis استفاده میشه هم اینه که redis داده  رو روی ram ذخیره میکنه و سرعت بیشتری در خوندن و نوشتن داده ها ، نسبت به  هارد دیسک ها و ssd داره.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "1abd11d4",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "Reader Service (سرویس خواننده)",
                "id": "8aaefcf8",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "این سرویس هم نقش خوندن داده ها رو برعهده داره ینی جایی که مثلا کاربرها  میخان محصولات رو ببینن و میان و سرور rest برای این میکروسرویس درخواست  میفرسته که مثلا همه یا یکی از محصولات رو نشون بده و سرویس هم از روی  redis این کار رو انجام میده که سرعت بیشتری پیدا کنه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "e3e403d7",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "سایر اجزاء",
                "id": "266b803d",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "بین این سرویس ها و سرور rest که توسط برنامه نویسی ساخته شده ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "(خودمو میگم)",
                                "style": {
                                    "weight": ["ITALIC"]
                                }
                            },
                            {
                                "text": " ، این سیستم از یه سری از اجزای دیگه هم استفاده کرده. که اگر قسمت های  بالا تر رو خونده باشید از kafka برای پیام رسانی بین سرویس ها ، از redis  برای ذخیره سازی داده های پر استفاده و کم حجم و از mongodb هم به عنوان  پایگاه داده های کلی سیستم استفاده شده.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "استفاده از اون هم به صورت  یک image هست که داخل docker hub قرار داره. به وسیله ابزار docker compose  که بسیار جالب و کاربردی هم هست. تمام دستوراتی که شما توی shell باید  بزنید رو به صورت مرتب و معنا دار و منظم تر داخل یک فایل با فرمت yml  میارید و خود compose اقدام به اعمال اون روی engine داکر میکنه و کار ها  رو بسیار سریع تر میکنه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "ddd792ac",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "نتیجه گیری",
                "id": "30635699",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "این یک مثال هست که بشدت ساده هست اما بخاطر  معماری میکروسرویس توسعه پذیری بالایی پیدا کرده ینی همین کدهای مثال و  ساده رو میشه به راحتی توسعه داد و به سمت یک سیستم معنا دار هدایت کرد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "از  یه طرف وجود داکر هم توی این قصه بی تاثیر نیست چون میشه منابع رو کنترل  کرد سرویس ها رو با ترتیب و نظم ایجاد و مدیریت کرد و توی مساله  performance بسیاری از مشکلات رو  برطرف کرد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "cbb3b223",
                "type": "caption"
            }
        ],
        "author": 1,
        "createAt": "1677754074738",
        "tag": ["معماری ", "میکروسرویس", "نرم افزار"],
        "photo": "3ae212a22b00d32e037e5e5556dfb77c.jpeg",
        "category": "f95a8cc667210192"
    },
    {
        "_id": {
            "$oid": "6400aee51ffd7ad6cb62551a"
        },
        "id": "68420c6126964933",
        "title": "درباره من",
        "content": [
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "من فرهنگ وقردوست هستم. فارق التحصیل مهندسی نرم افزار که توی 27 سالگی بازنشسته شده!",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "عمده زمانی که میگذرونم به برنامه نویسی و ساختن چیزای جدید ختم میشه و تصمیم گرفتم این بلاگ رو ایجاد کنم و درباره چیزایی که میسازم توضیح بدم.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "عمده تخصص من از ابتدا جاوا بود ولی دیگه کارم با جاوا تموم شد و شدم برنامه نویس نود جی اس.بیشتر backend کار هستم ولی سعی دارم توی frontend قوی تر بشم.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "هدفم آموزش حرفه ای نیست و بیشتر اشتراک تجربه هام و معرفی کد هام هست و صرفا بخاطر اینکه میخاستم اتاقم رو خودم طراحی کنم این بلاگ رو ایجاد کردم و از اینستاگرام یا تلگرام استفاده نکردم. هرچند تا به این لحظه توی برنامه هام هست که سمت اون ها هم برم.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "دید من به برنامه نویسی یکم متفاوت نسبت به اکثر همکارام هست. اینکه",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": " نه فقط برای بدست آوردن یه شغل خوب یا درآمد ، بلکه برای عملیاتی کردن ایده هایی که فکر میکنی جذاب هستن برنامه نویس شو . ازش لذت ببر و نتیجه رو تماشا کن و هیچ وقت یادگرفتن رو متوقف نکن",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": ".",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "04aa8b6a",
                "type": "caption"
            }
        ],
        "author": 1,
        "createAt": "1677766373204",
        "tag": [],
        "category": "5e7552aacbbe3ec5"
    },
    {
        "_id": {
            "$oid": "6400afc91ffd7ad6cb62551c"
        },
        "id": "b4433669c676116e",
        "title": "ایران برای برنامه نویس ها",
        "content": [
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "از وقتی که یادم میاد میگن خارج بابا همه چی سرجاشه ، اینجا ایرانه هیچی سرجاش نیست و کلا خارج میشه جای خوب و مملکت ما هم جای بد.متاسفانه درست از آب دراومده و مملکت ما توی هیچ نکته ای بهتر از کشور ها دیگه نیست.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "4b54d367",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "پیشگفتار",
                "id": "99c49347",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "این نوشته هم جنبه حرفه ای و انتقادی داره. اینکه چرا یه سری شرکت ها به معنای واقعی دنبال کسی هستن که از زاکربرگ چیزی کم نباید داشته باشه ولی حقوق بشر رو رعایت نمیکنن و کلی سفته و تهدید و توقع دارن. کاملا انتقادی هست و هیچ اغراقی هم توش ندارم.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "8c18b052",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "دوران کهن",
                "id": "2e8153db",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "من مهرماه سال 1380 وارد مدرسه شدم. اونجا یادمه اول مهر بود و من هم کلاس اولی بودم که نمیدونم کی بود ولی رییس کل آموزش و پرورش بود یا کجا بود که اومده بود بازدید و اول از همه هم اومد سراغ ماها و دقیقا کلاس ما.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "اومد پرسید خب بچه ها امروز شما اومدید مدرسه و کلی صحبت ها کسل کننده و مثل مالیدن پنیر به نون یکمم ایمان و تقوا و نماز هم مالید به حرفاش و یه سوال پرسید.گفت ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "میخواید چیکاره شید",
                                "style": {
                                    "weight": ["ITALIC"]
                                }
                            },
                            {
                                "text": " و دستا رو بردن بالا میگفتن \"",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "خلبان میخام بشم",
                                "style": {
                                    "weight": ["ITALIC"]
                                }
                            },
                            {
                                "text": "\" ، \"",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "میخام دکتر بشم\"",
                                "style": {
                                    "weight": ["ITALIC"]
                                }
                            },
                            {
                                "text": " ، ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "\"میخوام مهندس معمار بشم\"",
                                "style": {
                                    "weight": ["ITALIC"]
                                }
                            },
                            {
                                "text": "جواب همشم این بود که باید درس بخونی. یکی از بین بچه ها بلند شد گفت ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "\"آقا اجازه ، میخام مهندس کامپیوتر شم\" ",
                                "style": {
                                    "weight": ["ITALIC"]
                                }
                            },
                            {
                                "text": "همه معلما خندیدن گفتن اوووه تو که دیگه باید خیلی درس بخونی خیلی باید کارت درست باشه.شاید اگر میگفت فیزیک هسته ای هم جوابش همین میشد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "اون دوران نرم افزار کار خیلی خیلی سختی به حساب میومد. کسی که برنامه نویس بود در حد یک متخصص موشک یا یک فیزیکدان اعتبار داشت و واقعا آدم باهوش برای اونکار لازم بود. دورانی که چیزی جز C وجود نداشت ، شما برای یک کلیک کردن روی یک دکمه باید کلی کد میزدید و اشاره گر به خانه رم میگرفتید. اینترنتی نبود در عمل و کتاب مرجع توی کتابخانه نوت برداری میکردید و اگر توی نوت ها بود که بود اگر نمیبود که هیچی باید خودتون کشفش میکردید.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "اون دوران بخاطر سختی هایی که این کار داشت ، کسی که برنامه نویس بود ، باید نابغه می بود.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "الان دیگه اینطوری نیست ، زبان برنامه نویسی گسترش پیدا کرده و هرچند نیاز به برنامه نویس و developer شدیدا بیشتر شده ولی الان اوایل سال 2023 میلادی ، زبان های برنامه نویسی ای هستن که به قول معروف اگر کدش رو شما توی google translate بذارید معنی فارسی و روان به شما میده.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "3f70e29e",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "استخدام",
                "id": "633accbb",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "نمیدونم چقدر تجربه دارید ولی من احساسی که تا الان دارم اینه که هرجا نه گفتم سود کردم. خیلی شرکت ها در قبال قرارداد یا حقوقی که به شما میدن و یقینا حق شماست سفته میگیرن. قانون کار سکوت کرده و حرفی درباره اینکه کارمند باید به کارفرما سفته بده نگفته.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "سال 96 بود یادمه توی گروه تلگرامی ای عضو بودم ، یه آقایی یه پیام گذاشت که استخدام جذاب و فوری شرکت فلان فلان و خیلی باید حرفه ای باشید کد ها در حد استاندارد فلان الگو ها باید باشه تسلط کامل به کلی کتابخانه جاوا و هایبرنیت و اسپرینگ بوت و ... حداقل سابقه کار 3 سال ، حداکثر سن 25 سال ، پایان خدمت برای آقایون اجباری هست و در کل یه صفحه نوشته بود. اولین جوابش این بود خب چقدر حقوق میدی مشتی؟ ششصد هزار تومن تا 1 میلیون (قانون کار اون زمان)",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "71ecf8af",
                "type": "caption"
            },
            {
                "richtext": [],
                "url": "http://localhost:31375/photo/aaeb6963697e3c9aa70927924071bf18.png",
                "id": "69306ac7",
                "type": "photo"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "شگفتی های بازار نرم افزار توی ایران رو حقیقتش کم نیست اما نباید بی تفاوت بود. به عنوان یک دوست میگم هیچ وقت از شان خودتون دربرابر کارفرمای گستاخ عقب نشینی نکنید. برنامه نویس ها کرور کرور از ایران دارن خارج میشن ، ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "کمبود برنامه نویس بشدت حس میشه",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " و بعضی از صاحبان کار توی مملکت گستاخ باقی میمونن و میگن بلاخره از بین 100 نفر یا 200 نفر یه زاکربرگ ساده لوح پیدا میکنم و در راستای منافعم با سفته و حقوق حقیر به بردگی و اسارت خواهم گرفت.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "3b838a2f",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "فریلنسری",
                "id": "929a40de",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "توی یه سایتی دیدم که نوشته بود آموزش پروژه محور ساخت توییتر با react. گفتم اگر توییتر به این سادگی میشد درست بشه که 10 تای دیگه از روش میساختن! ریسک کردم و خریدم هرچند فقط فرانت بود ولی دیدم جدی جدی همشو ساخت!!!",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "یه سری بود که خواستم برم یه سایت فریلنسری و پروژه بردارم. دیدم یه فردی یک ربات آهنگ میخاست که تقریبا 52 ردیف ویژگی داشت. یکیش مثلا اینکه کاربر مثلا بیاد یک تکه از آهنگ رو بخونه و ربات براش بفرسته. البته نمونه این ربات بود ولی ارزش پروژه بین 100 تا 500 هزار تومن سال 96 بود.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "5990f726",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "نتیجه گیری",
                "id": "683ce874",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "نظری درباره کارفرمای خوب ندارم. حقیقتش کارفرمای خوب هم داشتم ولی تعریف و تمجید بنظرم تو بعضی مسایل اتلاف وقت هست. از یک طرف دیگه کارفرمای خوب نیازی به تعریف و تمجید من نداره.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "اما ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "کارفرمای بد زندگی شما رو سیاه خواهد کرد",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " و تجربه ی کار کردن با این دسته ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "مفید هست ولی خوب نیست",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": "...",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "42eaf99e",
                "type": "caption"
            }
        ],
        "author": 1,
        "createAt": "1677766601275",
        "tag": [],
        "category": "5e7552aacbbe3ec5"
    },
    {
        "_id": {
            "$oid": "6400b0681ffd7ad6cb62551e"
        },
        "id": "9c75d598e28bba57",
        "title": "مصائب زندگی در ایران",
        "content": [
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "بهرحال هر موجودی خانه خودشو دوست داره. حتی اگر رفتار یک خرس رو ببینید متوجه میشید که چقدر خانه خودشو دوست داره. من آدم وطن پرستی هستم ولی میدونید که ایران جای زندگی نیست و این هر روز داره بیشتر نمود پیدا میکنه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "هرچند این نوشته خیلی نرم افزارانه و این صحبت ها نیست ولی نیاز بود چیز هایی رو از توی دلم بریزم روی صفحه ی وب :)",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "bb77c10c",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "پیش گفتار",
                "id": "6c56d126",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "میخام بیشتر درباره ی اینکه چقدر طول کشید تا کنترل زندگیم رو به دست بگیرم صحبت کنم. انتقاد از سیستم خطرناکه ولی بنظرم کار سختی نیست. چون اونقدر آتو دیدیم و اونقدر تصاویر عجیب و اظهارنظر های گستاخانه شنیدیم و دیدیم که هرکسی میتونه انتقاد کنه و همه ما یه دل پر داریم.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "76f1fa35",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "از ابتدایی تا بازنشستگی",
                "id": "c222fca7",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "اول ابتدایی که رفتم توی سن 6 و نیم سالگی سال 1380 احساس میکنم یجورایی کارم شروع شد .از صبح زود بیدار شدن با چه سختی ای و رفتن به مدرسه صبح سوز و سرمای زیرصفر و لحظه شماری که زود برگردیم خونه. این حسی بود که تا سال آخر دبیرستان داشتم. یعنی جذابیتی وجود نداشت که بخام ساعت ها رو توی مدرسه بگذرونم.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "تصورم اینه که بقیه کشور ها چون مدرسه دارن ما هم باید داشته باشیم. درحالی که کشور های پیشرو مثل ژاپن یا آلمان تحول های زیادی رو اعمال کردن و نتیجه گرفتن ، ما جاهلانه همان که بودیم ماندیم و از زمان رضاشاه که مدرسه همون بود تا الانش همونه درحالی که دنیا دگرگون شده ، که شاید خب دیگه از جنگل ها و کوه برای مدرسه رفتن قرار نیست بگذریم یا با پای لخت مدرسه بریم ولی سیستم همونه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "اول ابتدایی مرحله بعدی راهنمایی مرحله بعدی دبیرستان بعدی کنکور ، دانشگاه و انتخاب واحد بیدارخوابی شب امتحان، خدمت سربازی و ... شد 26 سالم که بازنشست شدم ازین مسایل.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "مساله اینجاست که بچه های مدرسه به من نگاه میکنن و میگن خوش بحالت تموم کردی همه این بدبختی ها رو و واقعیتش احساس میکنم که توی آسایش هستم.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "اینکه جامعه طوری طراحی شده که بگم سخت ترین سالهای عمرم بهترین سالها بود ، شاید درست باشه ولی خب من یکی از خیلیهای دیگه هستم.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "d31a388c",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "سربازی دقیقا چیه؟",
                "id": "d4244aa0",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "خدمت سربازی یکی از bug های ناجور کشور ماست. من آموزشی سختی داشتم. ارتش بود و برای سرباز ها ارتش سختگیر ترین ارگان نظامی و مسلح کشور بحساب میاد. هرچند به معنی واقعی نیروی زمینی به مراتب بدتره ولی من نیروی پدافند هوایی ارتش بودم توی نوع خودش سخت بود.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "خیلی از کادر اطرافم آدم های خوبی بودن. حتی گاهی دلم براشون تنگ میشه و یادشون میکنم ، شماره تماسی دارم بهشون زنگ میزنم احوالپرسی میکنم. یه سری نقطه ی مقابل هستن که نیازی به گفتن نیست...",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "تاثیراتی که سربازی روی خیلی از بچه ها گذاشت ابدی هستش. روی دیوار برجک های پاسداری که از زندان بیشتر یادگاری گذاشتن از اونی که شب عروسی معشوقه خودش توی زمستون داشت نگهبانی میداد و میخاست همونجا بمیره تا اون سربازی که گفت یه روز برمیگردم جناب سروان ترورت میکنم حالا برای یه عده خنده دار هستش ولی من آدم های خیلی خیلی با استعداد و خبره ای دیدم که اونجا قسمتی از درونشون مُرد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "متاهل ها که عائله با اونها بود و شغلشون رو باخته بودن یا من کسی رو دیدم که راه میرفت پول درمیاورد اما سرباز شده بود و خیلی باخت داده بود.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "بهرحال اینجا ضربه ای هست که باید تحمل کنیم و شاید خیلی از خانم ها بگن کاش مرد می بودیم ، واقعیتش مساله مرد یا زن بودن نیست بحثی هم توی اینکه مرد بودن سخت تره یا زن بودن ندارم مساله مملکت هست.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "7ad70f8b",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "نتیجه گیری",
                "id": "bc37cf60",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "کار خوبه خدا درست کنه سلطان محمود خر کیه؟",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            }
                        ]
                    }
                ],
                "id": "d1996b19",
                "type": "caption"
            }
        ],
        "author": 1,
        "createAt": "1677766760492",
        "tag": [],
        "photo": "8378cd4f3080c28a0f665d2f02175e5a.jpeg",
        "category": "5e7552aacbbe3ec5"
    },
    {
        "_id": {
            "$oid": "6400b1c11ffd7ad6cb625520"
        },
        "id": "cb19c000d579cb4e",
        "title": "نمیتوانید نکنید",
        "content": [
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "یه دورانی داشتم تلوزیون نگاه میکردم (",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "مال زمانیه که قابل دیدن بود",
                                "style": {
                                    "weight": ["ITALIC"]
                                }
                            },
                            {
                                "text": ") دیدم یه آقای منتقد داره یه فیلمی رو نقد میکرد. صاحب فیلم اومد رو خط زنده برنامه و یه جمله گفت انتقاد ، هنر بی هنران است حالا من خب انصافا بی هنر نیستم ولی یه جاها لازمه حرفایی بزنم.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "5990372d",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "پیشگفتار",
                "id": "a76fee8e",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "کار های دیگه رو نمیدونم ولی کار ما ، یعنی توسعه ی نرم افزار ، یک کار فنی و حرفه ای هست. جنبه فنی همین که برای مثال چجوری یک کد رو بنویسیم و جنبه ی حرفه ای اینه که چجوری کار کنیم. چقدر وقت بذاریم و این صجبت ها. هم جنبه فنی و هم جنبه ی حرفه ای روی هم تاثیر میذارن",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "توی این نوشته درباره جنبه ی حرفه ای صحبت میکنم.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "4aa4117c",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "بودن یا نبودن",
                "id": "945c7db4",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "یکی دو سال پیش بود که یکی خبرگذاری ها یه مصاحبه با آقای دادکان (",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "رئیس فدارسیون فوتبال سابق",
                                "style": {
                                    "weight": ["ITALIC"]
                                }
                            },
                            {
                                "text": ") انجام داد. ایشون یه مقداری برافروخته و یه مقدار بیشتر رک بودن. یه جمله درستی ، خطاب به مسوولان مملکت گفت که \"",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "نمیتونید انجام بدید، برید ، موظف نیستید که چند سال رییس باشید ، بدید به کسی که کار رو بلد هست\"",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "یه تصوری توی ذهنی دارم که تیم های برنامه نویسی مثل یه کشتی پارویی میمونه که شما به اندازه وزنی که به کشتی اضافه کردی باید پارو بزنی حتی بیشتر وگرنه جور این کار رو هم تیمی ها خواهند کشید.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "اگر جایی به نتیجه ی نهایی رسیدید که مفید نیستید، به اعتقاد من منافع مالی کوتاه مدت رو رها کنید و از اون تیم ها خارج شید.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "یه زمانی به جایگاه مدیر تیم های نرم افزاری فکر میکردم که اگر به من پیشنهاد بدن چه جوابی باید بدم. رک بگم قبول نمیکنم . اگر الان به من بگن بیا سرپرست تیم مثلا برنامه نویسی باش قبول نمیکنم چون اعتقاد دارم فقط دانش کد زدن لازم نیست مدیریت لازم داره و من هنوز دانش مدیریتی ندارم، بنابراین نمیتوانم ، انجام نمیدهم.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "aba2c517",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "آموزش",
                "id": "1869b123",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "توی دانشگاه به ما ++C آموزش میدادن. یه آموزش حقیر ، سطح پایین و ناکارآمد ،که اکثر دانشجوهای نرم افزار ممکنه تجربه کرده باشن. اگر هم کسی پرسید میگفتن بله داریم به بچه ها ++Cآموزش میدیم همونی که بیرون یاد میدن.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "با اینکه فاکتوریل چیه و شرط و حلقه و اینا رو یاد دادن و در عمل کد حفظ میکردیم. تا به امروز متوجه نشدم نیت بعضی اساتید اون دوران چی بود. رفتارشون طوری بود که حتی با گذشت زمان هم اینطور به بعضی اینطور القا میشد که : آقای فلانی من دوست ندارم تو برنامه نویس باشی و درکل مایوس میکردن.البته گاهی فکر میکنم شاید تحت تاثیر فیلم wiplash بودن ولی خب اگر اون استاد خیلی روی برنامه نویسی هم تعصب داشته باشه چرا باید منبع درآمدشون مغازه کفش فروشی باشه؟ درکل فکر میکنم دانشگاه دلیل این بود که ++C رو نشناسم.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "a5a751e9",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "بازیکن خوب ، مربی خوب",
                "id": "79559fb8",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "وارد ترم دوم شدیم. یه آقایی بود، که ادعای زیادی داشت. ترم دوم برنامه نویسی پیشرفته ی 2 زبان برنامه نویسی سی شارپ (#C). ما که اوج تخصصمون توی نرم افزار ساختن از ترم قبل، یک sort یا جستجوی تصادفی بود.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "روز اول برای ما نرم افزار paint رو در کمتر از 10 دقیقه طراحی کرد و یادمه پرسیدم استاد class یعنی چی؟ جوابش رو به زبان چینی بهم داد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "ایشون برنامه نویس خوبی بود. رزومه ی خوبی داشت ولی کارش آموزش نبود. یا حداقل اون دوران کارش این نبود. قطعا که مدرس باید برنامه نویس خوبی باشه اما ، ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "یک برنامه نویس خوب ، قطعا و الزاما یک مدرس برنامه نویسی خوب نخواهد بود",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": ". پس اگر نمیتوانید یا حداقل در این بازه نمیتوانید ، نکنید.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "261fdade",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "سخت ترین کار",
                "id": "128b8bb3",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "یه نرم افزار تقریبا گمنام وجود داره به اسم apache hadoop. این نرم افزار نسبتا قدیمی هم هست و سال 2006 منتشر شده. با جاوا نوشته شده و کارش ذخیره سازی میلیون ها رکورد در بازه ثانیه هاست.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "اگر سخت افزار شما قدیمی و ارزان هست برای ذخیره میلیون رکورد در ثانیه بهترین انتخاب همین hadoop هست. اونقدر مهم و کمیاب هست که توی کل کشور تعداد انگشت شماری به این نرم افزار تسلط دارند توی bigdata جایگزینی نداره . هیچ منبع آموزشی کاملی تو اینترنت براش نیست و بزرگترین دوره های آموزشی این نرم افزار در کشور چین برگذار میشه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "اگر به شما گفتند بیا پیشتیبان هادوپ باش و در حد همین توضیحات دربارش دونستید که چیه قبول نکنید. اگر گفتن میفرستیم دوره ببینی و بعد بیا و پیشتیبان باش و شما هم حوصله و اعصاب نداشتید ، احساس کردید تنها میشید یا از کد زدن دور میشید ، ترجیحا سراغ این دسته کارا نرید. کار سختی هست و حوصله و اعصاب میطلبه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "63866819",
                "type": "caption"
            },
            {
                "richtext": [],
                "url": "http://localhost:31375/photo/1c9a9888e4379bdd3329e6c8800cd705.png",
                "id": "8907a686",
                "type": "photo"
            },
            {
                "header": "h3",
                "text": "این کجا ، آن کجا",
                "id": "8ffd0018",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "سال 95 مقطع کارشناسی نا پیوسته دانشکده فنی پسران شهید باهنر شیراز قبول شدم. روزهای اول توی سلف دانشگاه ؛ دیدم میز نهارخوری یکی از دانشجو ها میگفت \"",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "یه ایده به ذهنم رسیده بگیره ، اپ خیلی خوب میشه یه دمو ساختم دیشب از روش بریم به استاد نشون بدیم عملیاتیش کنیم",
                                "style": {
                                    "weight": ["ITALIC"]
                                }
                            },
                            {
                                "text": "\".",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "مقایسه میکنم با دانشگاه قبل که مدیر گروهش با یه استادی درگیر میشه و واحد ها رو ازش میگیره و خودش میاد تدریس کنه و توی کلاس 90 دقیقه ای بالای یک ساعت درباره مشکلات فوتبال استان صحبت میکنه .",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "برای فردی مثل من که مقطع قبلی توی اون دانشگاهی بودم یعنی اومدم هاروارد! مقایسه ی دانشگاهی که مدیر گروهش صحبت از جشنواره خوارزمی میکنه و دانشگاهی که مدیر گروهش خبر نداره css چی هست و فوق لیسانس هم داشت دقیقا همینه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "اینکه چرا مدیر گروه بود دلیلش همونه که ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "خیلی جاهای دیگه مملکت ما همینه و خیلی از مدیر ها با همین نوع\"چرا\" روی صندلی نشستن.",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " اگر مدیریت کار شما نیست نکنید.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "09e327ed",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "آیا ، برنامه نویسی کار شماست؟",
                "id": "3b22826c",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "بعضی کارها استعداد لازم داره. مثلا قد زیر 190 سانتیمتر در ورزش والیبال تقریبا فایده ای نداره. یا یک آدم با 50 کیلو وزن احتمالا کارش وزنه برداری یا مردان آهنین نیست.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "مساله برنامه نویس بودن چیز دیگه ای هست چون ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "با تمرین میشه برنامه نویس شد",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " و استعداد ویژه ای هم لازم نداره. ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "برنامه نویسی یه مقداری برای یه جاهایی اعصاب و روان و در مجموع به حوصله و مُمارست نیاز داره",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " که خیلی از کار ها این ها رو لازم دارن.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "حتی ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "تخصص در برنامه نویسی کار به مدرک هم نیست",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": ". خیلی از همکار های من دیپلم و حتی زیر دیپلم هستن و عهده دار کارهای سنگین هستن و درآمد دلاری دارن .",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "اما مدیریت تیم برنامه نویسی ، احتیاج به کاریزما ، تخصص ، دانش و استعداد مدیریتی هست. خیلی شرکت های بزرگ مدیر ها حتی دست به کد هم نمیزنن کار یا به اصطلاح تسک رو به نفرات تیم واگذار میکنن و طی یک مدت ازش تحویل میگیرن.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "df5a7cbc",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "نتیجه گیری",
                "id": "9cf9bcc5",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "کل این داستان ها مثال ، نظر شخصی و توصیه برادرانه بود. یه بازیکن خوب حتما یک مربی خوب نخواهد شد و یک برنامه نویس خوب لزوما یک مدیر تیم خوب یاد مدرس برنامه نویسی نخواهد بود.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "اگر برای مثال آموزش کار شما نیست یا بلد نیستید ، این کار رو نکنید. تا برنامه نویس مسلطی نشدید ، تسک بزرگ قبول نکنید.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "تا با هنر انجام کار به وسیله دیگران آشنایی ندارید مدیریت جایی رو قبول نکنید و مسایل موازی دیگه با این موضوع ....",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "433f8b82",
                "type": "caption"
            }
        ],
        "author": 1,
        "createAt": "1677767105256",
        "tag": [],
        "photo": "8b064f35145904effc0cc9f5b88754a7.jpeg",
        "category": "5e7552aacbbe3ec5"
    },
    {
        "_id": {
            "$oid": "6400f0fc1ffd7ad6cb625524"
        },
        "id": "0859fe9ce0b2c152",
        "title": "nestjs چیست؟",
        "content": [
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "قطعا فقط با خواندن این مطلب شما تبدیل به برنامه نویس nestjs نخواهید شد ، زیرا این فریم ورک بسیار گسترده و عمیق هست.آموزش های بسیار بسیار با کیفیتی برای فریم ورک های مختلف از جمله همین nestjs در سطح وب فارسی و بین الملل وجود دارد.دراین نوشته بیشتر به معرفی کوتاه آن خواهیم پرداخت.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "6dfbee3b",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "پیش گفتار",
                "id": "affaa8d7",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "فریم ورک nestjs یک فریم ورک نوشته شده برای node js هست که کد آن با تایپ اسکریپت نوشته میشود.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "یکی از تعریف فریمورک در علم نرم افزار این است که شما برای یک برنامه دیگر کد میزنید، ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "یعنی در فریمورک ، کد شما توسط یک برنامه call میشود",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " و برعکس تعریف کتابخانه قرار دارد. یعنی کد شما ، کد کتابخانه را call میکند.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "این فریم ورک یک چارچوب بسیار مناسبی از آرایش کد به برنامه نویس ارایه میدهد و خوانایی کد را براساس قاعده و قانون هایی که دارد بالا میبرد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "الگوی این فریم ورک از روی ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "angular js",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " برداشته شده است. ساختار آن به این صورت است که پروژه به صورت مجموعه ای از",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "module",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " ها ساخته میشود.module ها همه به یک ماژول اصلی متصل میشوند ودر عین حال میتوانند با همدیگرتعامل داشته باشند.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "یک کلاس module از اجزایی تشکیل میشود که با حاشیه نویسی یا همان ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "annotation",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " نقش انها تعریف میشود. خود module یک کلاس با ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "@module",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " تعریف میشود",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "26e9c024",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "ماژول (Module)",
                "id": "43b96bcc",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "هرکدام از این اجزا به صورت لیست تعریف شده و توضیح هرکدام از اجزای moduleبه شرح زیر هستند:",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "controllers ",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": ": دریافت کننده داده ها از خارج در این دسته کلاس ها هستند. برای مثال مسیر هایی که از درگاه rest api تعریف میشوند . یا رویداد هایی که برای socket نوشته میشوند و یا حسگرهایی برای میکروسرویس ها و ...",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "services",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": ": کلاس هایی که عملیات ها در آن نوشته میشوند",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "imports",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": ": ماژولی که ممکن است جایی دیگر تعریف شده باشد و قرار است در این ماژول از اجزای آن بهره برد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "exports",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " : سرویس هایی که در این لیست داریم قابل استفاده در آن ماژول هایی خواهد بود که این ماژول را import کرده باشند.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "443411d6",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "یک مثال ساده",
                "id": "23ba4482",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "کلاسی که با @Controller به عنوان کنترلر تعریف شده در ساختار این ماژول ثبت میشود.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "در فهرست سرویس هایی که در این ماژول ثبت شده اند کلاس SimpleService هست که در داخل این کلاس متد هایی وجود دارند که عملیات را روی داده های دریافتی کنترلر انجام میدهند.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "ماژولی به نام Database در این ماژول import شده که سرویس هایی که در آن ماژول export شده است را میتوان در سرویس های اینجا استفاده کرد. و اگر این ماژول در جای دیگری import شود سرویس simpleService قابل استفاده خواهد بود",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "c43682d2",
                "type": "caption"
            },
            {
                "text": "@module({\n\tcontrollers:[ SimpleController ],\n\tservices:[ SimpleService ],\n\timports: [ DatabaseModule ],\n\texports: [ SimpleService ]\n})\nexport default class SimpleModule(){}",
                "id": "02dc2729",
                "type": "code"
            }
        ],
        "author": 1,
        "createAt": "1677783292284",
        "tag": ["nodejs", "nestjs", "framework ", "فریمورک", "نود جی اس"],
        "category": "0ac5ec59adedab83",
        "photo": "d739cee9751e4fc12376bfffbc34486a.jpeg"
    },
    {
        "_id": {
            "$oid": "6400f2001ffd7ad6cb625526"
        },
        "id": "21ab00339d30532e",
        "title": "معرفی FCMS",
        "content": [
            {
                "header": "h3",
                "text": "پیشگفتار",
                "id": "c82636a3",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "سیستم مدیریت محتوای FCMS یک سامانه نرم افزار مبتنی بر معماری میکروسرویس هست. با فریم ورک nestjs ساخته شده و از kafka برای ارتباط بین اجزا استفاده میکند. همچنین در بعضی از میکروسرویس های این سیستم از redis برای بهبود سرعت استفاده شده و عمدتا از mongodb به عنوان پایگاه داده ها استفاده میشود.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "اجرای این سیستم بیشتر توسط docker انجام میشود. اما میتوان خارج از محیط داکر هم این سیستم را اجرا کرد (",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "پیشنهاد میشود از همان docker استفاده کنید",
                                "style": {
                                    "weight": ["ITALIC"]
                                }
                            },
                            {
                                "text": ")",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "a92f4db2",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "اجزاء",
                "id": "0cae1c95",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "FCMS دارای 3 قسمت کلی هست.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "Rest Gateway: ",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": "همان سرور Rest که کار آن عمدتا دریافت داده ها از کاربران معمولی و رساندن آن به میکروسرویس مربوط به خودش هست.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "File Repository:",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " این قسمت ذخیره ساز فایل ها هست. اگر چه میشود از لینک هایی خارج از سیستم هم استفاده کرد اما این نرم افزار اختصاصی آپلود و ارسال فایل ها را انجام میدهد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "Microservices:",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " دایرکتوری مربوط به میکروسرویس ها هست . میکروسرویس ها در Rest Gateway یک ماژول اختصاصی دارند که داده های خودشان را از آن مسیر ها دریافت کرده پردازش میکنند و پاسخ آنرا برمیگردانند.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "1ddc6041",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "Rest Gateway",
                "id": "9f2b2dbf",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "این برنامه در واقع یک سرور rest هست که دریافت کننده همه داده ها از سوی کاربران خارجی بحساب می آید. این برنامه هیچ پردازش مستقیمی روی داده ها انجام نمیدهد و داده ها را از هر مسیری دریافت میکند به میکروسرویس مربوط به آن فرستاده و پاسخ را از همان میکروسرویس برمیگرداند.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "تنها پردازشی که این برنامه انجام میدهد احراز هویت هاست. نقش ها در سیستم در این برنامه تعریف میشوند و برای استعلام ها به میکروسرویس مربوط به خودشان فرستاده میشود.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "برای مثال اگر مدیری بخواهد وارد سیستم شود به ماژول احراز هویت پیام میدهد و این ماژول با استعلام گرفتن مشخصات آن مدیر از میکروسرویس admin احراز هویت مدیر را انجام میدهد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "همچنین میکروسرویس ها اگر لازم باشد تا با کاربر بیرونی ارتباطی از طریق rest داشته باشند ازین طریق انجام میدهند و ماژول خود را در این نرم افزار باید قرار دهند. اعتبار سنجی داده های دریافتی هم به همین ترتیب خواهد بود.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "36582a9a",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "File Repository",
                "id": "1722334b",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "مخزن فایل جاییست که فایل در آن آپلود و دانلود میشود. فقط مدیران میتوانند در آن فایل جایگذاری کنند و این سرور حالت static نیست. و میتواند لینک مدت دار از فایل ها را برای کاربران ایجاد و ارسال کند.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "این برنامه هم به نوعی شباهت به rest gateway دارد با این تفاوت که این برنامه تنها با میکروسرویس ادمین برای احراز هویت و استعلام ها کار میکند.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "7b3da4ca",
                "type": "caption"
            },
            {
                "richtext": [],
                "url": "http://localhost:31375/photo/3ae212a22b00d32e037e5e5556dfb77c.jpeg",
                "id": "a365f079",
                "type": "photo"
            },
            {
                "header": "h3",
                "text": "Microservices میکروسرویس ها",
                "id": "bd8b278f",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "براساس معماری میکروسرویس، یک سیستم با ویژگی ها گسترده و فراوان را میتوان به چند سیستم یکپارچه تقسیم کرد. این معماری هم برای کارایی یا همان performance مناسب هست هم برای توسعه پذیری.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "برای مثال اگر بخواهیم به این سیستم امکانی را اضافه کنیم، میتوانیم میکروسرویس آنرا ایجاد کرده و در سمت فرانت آنرا پیاده سازی کنیم.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "در حال حاظر تا زمان ایجاد این نوشته برای این سیستم ، 3 میکروسرویس وجود دارد:",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "Note: ",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": "این میکروسرویس برای بلاگ نویسی تهیه شده و میتوان مطالب را به صورت متنوع و در دسته بندی هایی تعریف کرد. همچنین دسته بندی هایی را میتوان به صورت درختی و سلسله مراتبی ایجاد کرد و مطالب را در آنها قرار داد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "Admin:",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " این میکروسرویس یک سرویس اصلی برای این سیستم هست به طوری که مدیران را در این سرویس تعریف میشوند و تعامل مستقیم به گیت و مخزن فایل ها دارد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "Record( بزودی ):",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " این سرویس داده و گذارشات سایر سرویس ها را ثبت میکند و همچنین امکان فرمان benchmark را برای سرویس ها فراهم می آورد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "این سرویس مجموعه گزارشات سرویس های دیگر را جمع آوری میکند و میتوان به پشتیبان دید آماری نسبت به عملکرد سیستم بدهد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "5f0754b3",
                "type": "caption"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "البته این پروژه متن باز و انتشار عمومی روی گیت هاب بود که به دلیل ترس از سو استفاده اون رو به صورت خصوصی درآوردم ولی بزودی یک نسخه متناسب و متن بسته رو برای کسایی که علاقه به انتشار مطالب دارن در اختیار خواهم گذاشت",
                                "style": {
                                    "weight": ["ITALIC"]
                                }
                            }
                        ]
                    }
                ],
                "id": "d987ce7d",
                "type": "frame"
            }
        ],
        "author": 1,
        "createAt": "1677783552223",
        "tag": [],
        "category": "f95a8cc667210192",
        "photo": "6cdc66eee3f23559c1434a6210f86722.jpeg"
    },
    {
        "_id": {
            "$oid": "6400f3801ffd7ad6cb62552a"
        },
        "id": "78ba8400bfd21fa6",
        "title": "اپلیکیشن مدیریت زمان",
        "content": [
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "حدودا تابستان سال 1400 بود که کنجکاو شده بودم که چقدر برای کارهایی که انجام میدم در طول روز وقت میذارم. از یه طرف دیگه هم اپ های زیادی روی گوشیم نصب بود و چیزی که همه اون امکاناتی رو که من میخاستم داشته باشه نداشت. نیاز سنجی این اپ بیشتر از روی نیاز های خودم بود.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "این اپلیکیشن با فلاتر نوشته شده",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " ولی توی این نوشته درباره کد صحبت نمیکنم و بیشتر این اپ رو معرفی میکنم.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "1dcf713d",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "پیشگفتار",
                "id": "71a244cc",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "اپلیکیشن مدیریت زمان توی سیستم کافه بازار موجود هست و میتونید اون رو به صورت امن دانلود کنید.این اپ ساخته شده که یک سری امکاناتی که شما برای محاسبه زمان لازم دارید رو کنار هم داشته باشید.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "از اونجایی که سورس کد این اپ بشدت اشکال داشت از اشتراک کد اون صرف نظر کردم اما شاید اگر وقت کنم و آپدیت بعدی اون رو عرضه کنم احتمالا با رفع اشکال های نوشتار کدش سورس اون رو برای کسایی که کنجکاون منتشر کنم.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "هیچ تبلیغی در این اپ وجود نداره و تماما هم رایگان هست.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "1d5164eb",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "بدرد چه کسی میخوره؟",
                "id": "9f3b8a61",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "این اپ ویژگی های زیادی داره که تک تک اون ها رو بهتون معرفی میکنم. برای هر کسی که در طول روز مشغول انجام کاری هست این اپ خیلی مفید هست. یک داوطلب نگون بخت کنکور مملکت که میخاد بدونه چند روز تا آزمون مونده یا در طول روز چقدر مطالعه داره.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "یا یک برنامه نویس عین من که مثلا میخاد بدونه چند روز از برای مثال فلان کارش گذشته یا برای تحویل پروژه چقدر وقت داره یا در طول روز چقدر کار میکنه ، چقدر مفید هست یا چقدر استراحت میکنه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "یک ورزشکار در حال تمرین های ورزشی یا یک بازنشسته که ممکن هست نیاز داشته باشه کد پستی خونشون یا رمز عبور سامانه بازنشستگان رو روی گوشیش داشته باشه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "خلاصه اینکه",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": " این اپ مجموعه امکانات مربوط به تاریخ و زمان رو توی خودش داره.",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            }
                        ]
                    }
                ],
                "id": "c2016483",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "امکان اول : جلسه",
                "id": "8ce4f8f0",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "برای مثال ساعت کاری این جلسه اینکه چقدر در طول یک بازه کار کرده و چقدر در استراحت بوده",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "url": "http://localhost:31375/photo/fc6c5b0575a086a006544c499518e594.png",
                "id": "b6f032fa",
                "type": "photo"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "این ویژگی شاید یکی از مهم ترین قسمت های این اپ باشه ، جایی که شما مثلا از یک ساعت تا یک ساعت دیگه درحال انجام کاری باید باشید و بین بعضی از ساعت ها به صورت منظم یا نامنظم استراحت میکنید.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "یا مثلا در کلاس درس مدرسه یا دانشگاه یا هرجای دیگه درحال تدریس هستید میخواهید ببینید که چقدر درحال تدریس و چقدر درحالت استراحت هستید",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "این امکان و همچنین گزارش نهایی و در نهایت ذخیره داده هایی که بدست آوردید میزان کار خودتون رو اندازه میگیرید.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "969d7147",
                "type": "caption"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "البته همه چیز بستگی به صداقت خودتون به خودتون داره که این اپ نمیتونه اندازه بگیره ",
                                "style": {
                                    "weight": ["ITALIC"]
                                }
                            },
                            {
                                "text": "¯\\_(ツ)_/¯",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "9ca17905",
                "type": "frame"
            },
            {
                "header": "h3",
                "text": "امکان دوم : خط زمانی یا timeline",
                "id": "8e6618ae",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "یک خط زمانی مشخص که به ترتیب از گذشته تا آینده و فاصله ها رو تا اون روز نشون میده",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "url": "http://localhost:31375/photo/04756b3990e8f1de3d0ef9f3bac61c63.png",
                "id": "3f24218a",
                "type": "photo"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "همون طوری که بالاتر درباره ویژگی های کلی اپ صحبت کردم ، یکی از ویژگی های بسیار مفید این سیستم timeline یا همون خط زمانی هست. که شما به عنوان کاربر این اپ میتونید رویداد های مختلفی رو در یک تاریخ مشخص کنید و اون رویداد روی خط زمانی به ترتیب از گذشته به سمت آینده قرار میگیره و میتونید فاصله رو به روز و ماه و سال با اون نقطه از تاریخ رو ببینید.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "7dfd7041",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "امکان سوم : مبدل تاریخ",
                "id": "a6f4bd6f",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "ین ویژگی و امکان هم تقریبا مشابه با خط زمانی هست منتها تاریخ فاصله تاریخ به روز و ماه و سال رو نشون میده و میتونید هم تاریخ قمری و هم تاریخ میلادی رو توی این قسمت داشته باشید",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "7fc46287",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "امکانات جانبی دیگر",
                "id": "5c2c6a7e",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "امکانات دیگه ای هم توی این اپ هست. مثل کورنومتر یا مبدل زمان که نشون میده چقدر فاصله تا یک ساعت مشخصی داریم یا اطلاعات دم دستی که یک کلید و مقدار هست مثلا کدپستی خونه رو یادتون میره یا شماره ملی کسی رو که لازم هست داشته باشید و ...",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "18f59028",
                "type": "caption"
            }
        ],
        "author": 1,
        "createAt": "1677783936936",
        "tag": [],
        "photo": "33894347ac8d9145aba50073fb7bc48c.png",
        "category": "90b1d846797174fa"
    },
    {
        "_id": {
            "$oid": "6400f7ef1ffd7ad6cb62552d"
        },
        "id": "a472dda153ed771d",
        "title": "آپاچی کافکا",
        "content": [
            {
                "header": "h3",
                "text": "پیشگفتار",
                "id": "f8cbfbe4",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "بین خیلی از سیستم های messageing که توی بازار موجود هست ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "kafka ",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": "احتمالا بهترین گزینه برای این کار بحساب میاد. هرچند گزینه های دیگه ای هم هست که شاید توی بعضی از ویژگی ها از kafka بهتر باشه ولی از نظر تنوع ویژگی و خیلی مسایل دیگه احتمالا kafka بهترین باشه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "e15f348d",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "یک سناریوی ساده",
                "id": "b2dcf8db",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "معماری میکروسرویس یعنی چند برنامه که با هم هماهنگ هستن و تحت یک بستر به هم پیام میدن.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "تصور کنید که یک سرور دارید که یک سامانه ی پیچیده هست و ویژگی های زیادی داره. این سامانه از 9 میکروسرویس تشکیل شده که هرکدوم کار یک ویژگی از سرور رو برعهده دارند.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "عین این 9 تا میکروسرویس باید یک قسمت یا بستر برای ورود و خروج داده هماهنگ با بقیه سرویس ها داشته باشن.حالا اینطوری میشه که 9 تا میکروسرویس هر کدومشون یک سرور rest هستن و بستر تبادل پیامشون این حالت هست.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "این حالت کلاسیک هست. منسوخ نیست و بقول بعضی از خبره های نرم افزار anti pattern یا ضد الگو نیست. اما ، روش های دیگه ای هم هست. روش هایی که میتونه بعضی حفره های این روش رایجی که گفتم رو پرکنه. برای مثال اگر یک request برای سرویسی که سرش خیلی شلوغ بود بره و هیچ وقت جوابی برنگرده ، احتمال اخلال رو توی کل سامانه ایجاد میکنه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "یکی از این روش های دیگه ، وجود یک سرویس مجزا برای تبادل پیام بین سرویس ها هست. سرویسی که بدونه حال و روز سرویس فرستنده و گیرنده چطوریه و آیا مثلا پیام رو دریافت کرده. یا همین سرویس مدیریت پیام ها بین بقیه سرویس ها میتونه از پس تعداد بالایی از پیام های بین سرویس ها بربیاد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "یه مثال بین برنامه نویس ها وجود داره که میگه :",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "وقت مهمه ، لزومی نداره که برگردیم به 6 هزار سال پیش و چرخ رو دوباره اختراع کنیم. اگر مشکلی که قبلا وجود داشته رو یکی حل کرده خب ما هم راه حل اون رو ادامه میدیم.",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "برای messaging بین سرویس ها قبلا نرم افزار هایی ساخته شده. یکی از معروف ترین اون ها ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "Apache Kafka",
                                "style": {
                                    "weight": ["ITALIC", "BOLD"]
                                }
                            },
                            {
                                "text": " هست که بقول معروف جز دسته بندی message broker ها یا همون دلال های پیام هست. نرم افزاری که پیام ها رو بین سرویس ها به مدتی که برای تعیین میکنید، آرشیو میکنه. میتونه برای سرویس ها احراز هویت و رمزنگاری پیام ها رو انجام بده و سرعتش به قدری بالاست که میلیون ها پیام رو در مقیاس ثانیه میتونه رد و بدل کنه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "95b63746",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "معرفی Apache Kafka",
                "id": "ae54db07",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "آپاچی کافکا یک نرم افزار پیامرسان بین نرم افزار های یک سامانه هست. کافکا به زبان جاوا نوشته شده ، قابلیت cluster شدن را دارد و از نرم افزار zookeeper بهره میبرد و میتواند میلیون ها پیام را در بازه ثانیه ارسال و دریافت کند.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "کافکا یک message broker هست. به این معنا که اگر مبدا پیامی را به مقصد ارسال کند در صورت عدم دریافت پیام توسط مقصد آن پیام منتظر بازگشت مقصد به شبکه کافکا خواهد ماند.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "533ece2e",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "بازدهی و کارایی",
                "id": "8a541b8e",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "نرم افزار های دیگری مشابه کافکا موجود هست که اصلی ترین رقیب کافکا سیستمی به نام rabbitmq هست. کافکا با توجه به الگویی که دارد میتواند میلیون ها پیام را رد و بدل کند درحالی که این رقم برای نرم افزار rabbitmq چیزی حدود 45 هزار پیام بر ثانیه است.اما rabbitmq برای سیستم های پیچیده حالت بهتری را فراهم میکند.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "0dc07bf5",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "ساختار",
                "id": "3e95eec2",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "ساختار کافکا به این شکل هست که برنامه های دیگر یا نرم افزار ها به آن متصل هستند. این نرم افزار ها پیام های خودشان را به در موجودیت هایی به نام ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "topic",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " قرار میدهند. همچنین سیستم های متصل به شبکه کافکا میتوانند پیام های درج شده در یک topic را دریافت کنند.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "آن جزء خارجی متصل به شبکه کافکا که بخواهد در تاپیک پیام بگذارد ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "Producer ",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": "یا تامین کننده نام دارد و آن جزء که بخواهد پیام های یک تاپیک را بخواند ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "Consumer",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " نام دارد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "70f25cf1",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "معماری میکروسرویس",
                "id": "7b19c85f",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "در معماری میکروسرویس ، گاها یک جز از سیستم برای رساندن یک پیام به جز دیگر از روش های سنتی ای استفاده میکنند که ممکن هست به اقتضای کار متناسب آن کار باشد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "برای مثال یک سامانه با ساختار میکروسرویس داریم که قسمت وب سرور آن پیامی را از کاربر خارجی دریافت میکند و برای پردازش باید به سرویس دیگری ارسال کند.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "یک روش سنتی این کار call کردن هست. به این صورت که هر جز از سیستم باید یک وب سرور باشند و باقی سیستم ها بتوانند از طریق rest برای آنها داده ارسال کنند و منتظر پاسخ باشند.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "روش کافکا اینطور هست که آن جز از سیستم که api خارجی دارد تامین کننده تاپیک آن جز دیگر سیستم هست که پیام های تاپیک خود را مصرف میکند.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "e3e48e43",
                "type": "caption"
            }
        ],
        "author": 1,
        "createAt": "1677785071540",
        "tag": [],
        "photo": "68761914265556cb71d47aacb6d8474d.png",
        "category": "90b1d846797174fa"
    },
    {
        "_id": {
            "$oid": "6400fab21ffd7ad6cb625530"
        },
        "id": "5713e88bdcc5a6c2",
        "title": "راهی به اسم nextjs",
        "content": [
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "یه زمانی علاقه زیادی به شطرنج نشون میدادم و یه اپ که هوش مصنوعی خوبیم داشت رو روی گوشیم نصب داشتم. اون هوش مصنوعی مشاوره میداد و بهم استراتژی پیشنهاد میداد. آخرش که کلافه شده بود گفت : ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "شاید تو به مساله باید یجور دیگه نگاه کنی!",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            }
                        ]
                    }
                ],
                "id": "184ec94b",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "پیشگفتار",
                "id": "16521170",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "nextjs یک فریم ورک node.js هست که به مساله اساسی کار نرم افزار ینی performance یجور دیگه نگاه میکنه نگاه next اینه ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "حداقل استفاده از backend و حفظ داده های دریافت شده.",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            }
                        ]
                    }
                ],
                "id": "8cdfb21c",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "سناریوی بدون راه حل",
                "id": "5005d6c4",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "توی کتابخانه react وقتی که سمت فرانت میخاد یک داده ای رو دریافت کنه از سرور میگیره و نمایشش میده ینی تصور کنید 100 کاربر آنلاین که 100 درخواست که با هم از نظر محتوا فرقیم ندارن با برنامه های ری اکت به سرور درخواست میدن و جوابش رو صرفا فرانت مرتب سازی میکنه و نمایش میده.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "برای مثال یک سایت بلاگ (عین همینی که هست) برای 100 کاربر دیگه قراره همین متن و محتوا نمایش داده بشه. پس چه فرقی با یک فایل html خام میتونه داشته باشه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "یک مثال دیگه ؛ فکر کنید شمای برنامه نویس یک کتابخانه ایجاد کردید که برای نحوه کار این کتابخانه لازم هست یه سری داکیومنت تهیه کنید. و شاید این کتابخانه یکبار برای همیشه نوشته شده و مستندات همین یکبار ایجاد خواهند شد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "توی این نمونه هایی که گفتم react مناسب این کار نیست. معماری میکروسرویس یا قوی ترین سرور ها برای کارهای دیگه ای باید استفاده بشن ولی برای این کار ساختن html css بهتر باید باشه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "تصور کنید react اینطوری باشه که شما طوری بنویسید که بره یکبار همه اون دیتا ها رو از backend برداره و توی اون component ها جاگذاری کنه بعد از روشون html و css خام ایجاد کنه!",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "این کاری هستش که nextjs انجام میده ولی نه فقط همین یک کار رو.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "7aa41182",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "تشریح کلی",
                "id": "8617a4f2",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "کد همون کد react هست . ینی میشه همون امکاناتی که توی react بود رو توی nextjs هم داشت. برای مثال redux رو میشه توی next هم داشت. ویژگی خیلی مثبتی که next داره اینه که دیگه نیازی به router نیست و با ترتیبی که فایل های component داخل page ها دارن همونطوری مسیریابی میشه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "توی این فریمورک باید به روش functional کد های react پیاده بشه چون هر page یک سری تابع رو باید به عنوان خروجی تحویل فریمورک بده.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "سیستم next توی سه فاز قرار میگیره",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "dev:",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " حالتی که برای برنامه نویس ها هست ینی همون حالت توسعه یا دیباگ که کدهایی رو که میزنید به hotreload به همراه اشکلات و غیره میبینید.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "build:",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " حالتی که کد هایی که نوشته شده ایجاد میشن و خروجی قطعی به حساب میان. تو این زمان با ارسال درخواست ها به backend محتوا ها و فایل های خام ایجاد میشن . ینی html ,و css و js خام رو با محتوای دریافتی از backend پرشده شده ایجاد میشه. وب سرور next در پاسخ request ها اون فایل html خام رو ارسال میکنه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "export: ",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": "این حالت همان حالت build حساب میاد فقط خروجی دیگه برای اجرا نیازی به وب سرور next نداره و فایل های خام هستن.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "شاید یه سوال پیش بیاد که چرا همیشه از export بجای build استفاده نکنیم. و سوالی هست که جوابش رو میدم...",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "07eb8d77",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "نقاط ضعف nextjs",
                "id": "9fc7c802",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "nextjs ایجاد نشده که بتونه react یا vue.js یا بقیه این سیستم ها رو از رده خارج کنه. چون نمیشه عملکردش رو با این دسته از کتابخانه ها یا فریمورک ها مقایسه کرد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "فریمورک nextjs برای سناریو های خاصی طراحی شده که قبلا هم توضیح داده شد. اگر پروژه شما ساختن یک سیستم مثل توییتر هست یا میخواید یک سامانه داشته باشید که هر لحظه در حال آپدیت شدن یا بروز رسانی داده هاش از سمت backend هست احتمالا nextjs گزینه ی خوبی برای پیاده سازی اینطور سیستم ها نیست.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "یک فروشگاه اینترنتی رو میشه با nextjs ساخت. فروشگاهی که مثلا محصولات نمایش داده میشن و ممکنه آپدیت هایی هم توی مشخصاتش اتفاق بیوفته. یا برای مثال محصول جدیدی اضافه بشه یا محصول دیگه ای حدف بشه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "نمیشه برای هر آپدیت یکبار از سیستم export گرفت ولی میشه با یکبار build گرفتن حالتی به وجود بیاد که نسبت به backend نظری داشته باشه و اگر تغییری اتفاق افتاد بجای build کلی فقط همون قسمتی که تغییر شده دوباره rebuild بشه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "یک کد رو مثال میزنم:",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "a290fe2b",
                "type": "caption"
            },
            {
                "text": "const Home = ({products}: Props) => {\n  return <>{\n    products.map((product)=><ProductCard data={product}/>)\n  }</>\n}\n\ninterface Props {\n  products: Products[]\n}\n\nexport const getStaticProps: GetStaticProps<Props> = async () => {\n  const products = await api.get(\"http://backend.io/producets\");\n  return {\n    props: {\n      products: products,\n    },\n    revalidate: 1\n  }\n}\n\nexport default Home;",
                "id": "d8759fc2",
                "type": "code"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "علاقه ی من typescript هست ، چون توسعه پذیری بهتری نسبت به javascript داره. در مجموع این دوتا تفاوت چندانی ندارن.",
                                "style": {
                                    "weight": ["ITALIC", "BOLD"]
                                }
                            }
                        ]
                    }
                ],
                "id": "79f73adf",
                "type": "frame"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "یک تابع ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "export",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " شده به اسم ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "getStaticProps",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " که این تابع در زمان build اجرا میشه. میاد و همون داده ها رو از سرور میگیره و توی مقدار جاگذاری میکنه. به اون قسمت revalidate اگر دقت کنید این معنی رو میده که این صفحه ینی لیست محصولات 1 دقیقه اعتبار داره.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "کاربر میاد و داده های قدیمی رو میبینه و سرور میره و نوسازی انجام میده ، کاربر بعدی که بیاد و این صفحه رو ببینه داده های جدید که از سرور دریافت شده رو میبینه. و این داده ها 1 دقیقه اعتبار داره.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "7aaa4e81",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "نتیجه گیری",
                "id": "fda67276",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "nextjs گسترده هست و توی یک نوشته نمیشه کاملا توضیحش داد اما امکانات جالبی داره که باعث شده تا برای بعضی سناریو ها انتخاب بهتری بحساب بیاد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "سازگاری بیشتر با سئو نسبت به react و کاهش شدید request ها به سرور باعث میشه تا توی این دسته سناریو ها انتخاب خوبی باشه...",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "62ae2d8a",
                "type": "caption"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "همین بلاگ با nextjs ایجاد شده. کد این بلاگ هم به صورت متن باز در اکانت گیت هاب موجود هست.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "url": "http://localhost:31375/photo/591a5f6ab9de47011e8bd9367f6a4478.png",
                "id": "5b2df50e",
                "type": "photo"
            }
        ],
        "author": 1,
        "createAt": "1677785778027",
        "tag": [],
        "photo": "725e2546ff5b531fe236a801cde8798a.jpeg",
        "category": "0ac5ec59adedab83"
    },
    {
        "_id": {
            "$oid": "6400fbd11ffd7ad6cb625532"
        },
        "id": "40c76407215f9cb8",
        "title": "متن بسته nodejs",
        "content": [
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "این درسته که بخاطر open source شدن نرم افزار ها توسعه ی اون شدت زیادی گرفت. ولی هنوز بستن کد منبع رواج داره و تمام دلیلش بحث های امنیتی و سو استفاده هاست.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "48e15034",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "پیشگفتار",
                "id": "91814add",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "گاها پروژه ای رو باید تحویل بدید که کد منبع اون غیرقابل خوندن باید باشه. برای مثال ازین بابت که ممکنه کد شما حفره هایی داشته باشه یا ساختار طوری باشه که بعضی خرابکار ها بیان و کد شما رو مطالعه کنن ، شما برای انتشار یک کد منبع بسته رو تحویل میدید که اجرا میشه ولی کد اون قابل خوندن نیست.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "7c1051fe",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "webpack",
                "id": "9cef8087",
                "type": "title"
            },
            {
                "richtext": [],
                "url": "http://localhost:31375/photo/374a57fc6473fca89de6f550f9621adc.jpeg",
                "id": "e47e828c",
                "type": "photo"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "کدهای جاوااسکریپت برای توسعه پذیری و درک بهتر برای برنامه نویس و در کل انسان ، بین فایل های مختلف تقسیم میشه. این کار زیاد تاثیری روی performance نداره ولی بهرحال بیانگر ساختاری و سازماندهی کد شماست.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "توی خیلی زبان های برنامه نویسی گاها شما ممکنه یک جمله ای رو شنیده باشید که گاها میگن ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "فایل bundle",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " منظور از فایل باندل همین بحث هست که میاد و تمام import ها و export ها توی فایل ها از بین میره و همه چی توی یک فایل جمع میشه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "برای جاوااسکریپت ابزاری هست به اسم webpack که میاد و همه ی فایل هایی که شما نوشتی رو توی یک فایل باندل میاره.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "106f423d",
                "type": "caption"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "البته گستره کار با webpack بیشتر از این صحبت هاست ولی توی این سناریو ما میخوایم از webpack برای بستن کد منبع استفاده کنیم",
                                "style": {
                                    "weight": ["ITALIC"]
                                }
                            }
                        ]
                    }
                ],
                "id": "ce924502",
                "type": "frame"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "کتابخانه ی webpack برای اینکه متوجه بشه که شما ساختار دقیق پروژه شما چطوریه و شما ازش چی میخواید ، یک فایل رو میخونه و براساس اون فایل باندل رو ایجاد میکنه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "شما باید روی root پروژه ، ینی همون فولدر اصلی ، یک فایل ایجاد کنید به اسم webpack.config.js که این فایل یک خروجی داره و اون خروجی آپشن هایی هست که webpack اون رو میخونه و اساس بر اون میشه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "b86fabb2",
                "type": "caption"
            },
            {
                "text": "const fs = require(\"fs\");\nconst path = require(\"path\");\n\nconst node_modules = {};\nfs.readdirSync(\"./node_modules\")\n    .filter((name) => {\n        return [\".bin\"].indexOf(name) === -1;\n    })\n    .forEach((name) => {\n        node_modules[name] = `commonjs ${name}`;\n    });\n\nmodule.exports = {\n    entry: \"./index.js\",\n    target: \"node\",\n    output: {\n        path: path.join(__dirname, \"build\"),\n        filename: \"bundle.js\",\n    },\n    externals: node_modules,\n};",
                "id": "9b4c282c",
                "type": "code"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "کد بالا یک نمونه ساده از یک فایل کانفیگ برای webpack هست. در قسمت module.export که اون نتیجه نهایی برای فایل هست یک سری گزینه ها هست که یکی یکی اونها رو شرح میدم.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "entry:",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " همون فایل اصلی رو نشون میده اونی که شروع کننده هست و همه ی import ها از اون شروع میشه...",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "target:",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " بیانگر اینه که کجا قراره این کد اجرا بشه ینی server side هست یا client side. اگر برای مثال شما بخواید برای react خروجی بگیرید مقدار اون متفاوت میشه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "output:",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " فایل باندل که ایجاد کردید کجا قرار میگیره،آدرس دقیق اون که با استفاده از ماژول path انجام میشه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "externals:",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " دایرکتوری node_module خیلی خیلی عمیق و شلوغ هست. گاها نشون دادن عمق فایل های موجود در اون خیلی زیاد میشه و یه جورایی ضعف نود جی اس هم حساب میشه اما ، اگر شما لازم باشه فایل های این رو هم توی فایل باندل خودتون جا کنید خیلی خیلی فایل بزرگ میشه و بقول معروف anti pattern هست. برای همین فایل باندل بهتره node_module رو توی خودش import کنه و هر فایلی قراره توی باندل import بشه با این گزینه شدنی هست.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "به استثنا دایرکتوری bin. بقیه تحت عنوان common {name} توی یک کلید مقدار به external اصطلاحا پاس داده میشه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "51d45311",
                "type": "caption"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "با استفاده از یک دستور ینی npx webpack init میتونید یک فایل webpack ایجاد کنین اما ممکنه بعضی از ساختار فایلهای شما رو تغییر بده برای همین پیشنهاد میکنم خودتون این فایل رو ایجاد کنید که هم به کار مسلط تر بشید هم ساختار حفظ شه",
                                "style": {
                                    "weight": ["ITALIC"]
                                }
                            }
                        ]
                    }
                ],
                "id": "13a15e33",
                "type": "frame"
            },
            {
                "header": "h3",
                "text": "bytenode",
                "id": "1fc89456",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "یکی از کتابخانه هایی که برای node js هست و فایل ها رو به صورت بایت کد در میاره کتابخانه ای به اسم bytenode هست. برای اجرا هم دیگه نمیشه برای اجرا مستقیم این فایل رو به node ارجا داد. برای همین باید از همین کتابخانه استفاده کرد. ضرورت ساختن فایل باندل به اینجا برمیگرده یعنی موقعی که اجرای bytenode حتما باید یک فایل یکپارچه داشت.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "979ea5df",
                "type": "caption"
            },
            {
                "richtext": [],
                "url": "http://localhost:31375/photo/84cc41a6863d8be0c1df4a0b1ee36866.png",
                "id": "cfdb590f",
                "type": "photo"
            },
            {
                "header": "h3",
                "text": "مثال",
                "id": "0472da58",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "حالا تصور میکنیم که فایل کانفیگ webpack رو به ترتیب بالا داریم. باید اول webpack رو نصب کنیم بعد با استفاده از دستور خودش فایل bundle رو بسازیم ، با bytenode از روی فایل باندل یک فایل بایت کد درست کنیم و در آخر هم با همون bytenode فایل باینری رو دانلود کنیم.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "3e2b9523",
                "type": "caption"
            },
            {
                "text": "// install webpack\nnpm install webpack webpack-cli\n\n// build bundle with webpack.config.js\nnpx webpack\n\n// install bytenode\nnpm install bytenode\n\n// build bytecodes with bytenode\nnpx bytenode ./build/bundle.js\n\n// run bytecode with bytenode\nnpx bytenode bundle.jsb",
                "id": "c5e6469a",
                "type": "code"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "bytenode تنها کاری که میکنه باینری کردن یا فقط خواندنی کردن فایل js هست. اصل کار زمانی هست که با webpack کار میکنید. معرفی webpack رو توی نوشته دیگه ای توضیح میدم.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "821c9235",
                "type": "caption"
            }
        ],
        "author": 1,
        "createAt": "1677786065455",
        "tag": [],
        "category": "0ac5ec59adedab83"
    },
    {
        "_id": {
            "$oid": "6400fcd91ffd7ad6cb625534"
        },
        "id": "b9c8b58b9b66100a",
        "title": "فرانت را دستکم نگیرید",
        "content": [
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "بعضا شاید اینطور تصور بشه که برنامه نویس های حرفه ای تر backend کارها هستن.البته که backend بسیار مهم و غیرقابل انکار هست اما دنیای فرانت برای من جای عجیبی بود",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "6eb9b324",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "بک اند کجا فرانت کجا",
                "id": "61870a4a",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "بیشتر توی backend چالش هایی که داشتم بحث performance بود. جایی که سیستم نمیکشید یا باید روش رو عوض میکردیم یا باید سخت افزار تهیه کنیم. چون به قول معروف ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "مغز متفکر و عامل اجرا backend هست یا فرانت باید از قانون backend تبعیت کنه.",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "شما برای backend با جاوا حال نمیکنید با سی شارپ کد بزنید، به گروه خونی شما نمیخورد، php هست ، املای گنگ و دشوار براتون داره ، سراغ پایتون برید یا روبی یا کلی زبان دیگه هست و برای هرکدوم اینا کلی فریم ورک هست.ولی ا",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "گر وب سایت میخواید ، چاره ای جز html و css و javascript ندارید",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": ". هرچند برای اینها فریم ورک هایی هست ولی درنهایت نمیتونید بدون دونستن برای مثال html تمام یک سایت را بسازید. خلاصه وار اینکه ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "بدون جاوا یا سی شارپ میشه سایت ساخت بدون html نه.",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            }
                        ]
                    }
                ],
                "id": "e9f34e8e",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "تسک backend و frontend",
                "id": "c415bce0",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "از نظر تعداد تسک ها یا وظایف برای اون کاری که من انجام میدادم تسک فرانت 10 برابر backend بود.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "چون ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "معمولا backend برای یکبار نوشته میشه و دست آخر هرچقدرم کمالگرا باشید",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " ، به اون فرم نهایی و دلخواه میرسید. اما فرانت بعد یه مدت فرانت حوصله کاربر رو سر میبره و باید یه تغییراتی رو توش اعمال کرد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "کد فرانت عموما روی سیستم کاربر نهایی اجرا میشه و منطق میگه ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "برای کمترکردن فشار روی سیستم بیشتر کار رو روی فرانت انجام بده.",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " برای مثال فرانت یک قالب حاضر و آماده از json رو باید از backend تحویل بگیره تحلیل کنه و نمایش بده. یا برعکس داده ای از کاربر بگیره و اعتبار سنجی کنه و داده مطمئن برای backend بفرسته. توی همچین سناریو هایی backend کلا یه crud بیشتر نیست. ولی فرانت علاوه بر نمایش داده به شکل چشم نواز ، زحمت همه کارهای جزیی رو باید بکشه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "00d8b4e8",
                "type": "caption"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "تسک backend ممکنه برای توسعه پذیری احتیاج باشه شما کد به قول معروف تمیز بزنید. خب این چیزیه که فرانت هم میخاد.",
                                "style": {
                                    "weight": ["ITALIC", "BOLD"]
                                }
                            }
                        ]
                    }
                ],
                "id": "31cbadae",
                "type": "frame"
            },
            {
                "header": "h3",
                "text": "نتیجه گیری",
                "id": "2db9954d",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "البته برنامه نویسی فرانت تاثیراتی هم بر روی برنامه نویسی backend گذاشت. از جمله اینکه قالب json که بومی زبان جاوا اسکریپت هست زبان انتقال داده های بسیاری از وب سرور ها شد و حتی پایگاه های داده ای مثل مانگو دی بی بوجود اومد که نوع جدیدی از پایگاه های داده رو معرفی کرد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "در مجموع نه backend به تنهایی به جایی میرسد و نه frontend. اما هرگز برنامه نویسان فرانت و طراح های وب را دستکم نگیرید. اون دسته برنامه نویسی که کدش باید هم باید حواسش به گرافیک و ظاهر باشد هم به محتوا و هم تحلیل کند برنامه نویسی خبره هست.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "ec700b0b",
                "type": "caption"
            }
        ],
        "author": 1,
        "createAt": "1677786329782",
        "tag": [],
        "photo": "3025655631604f919919fdb78fe7d962.png",
        "category": "6f55af0fceabffd5"
    },
    {
        "_id": {
            "$oid": "6400fd861ffd7ad6cb625536"
        },
        "id": "4b91cf31ac1bfb85",
        "title": "چرا کارم با جاوا تمام شد",
        "content": [
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "من اصول برنامه نویسی رو با جاوا یاد گرفتم ، یعنی اولین زبان برنامه نویسی ای که کار کردم جاوا بود.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "سعی کردم دانشم رو توی برنامه نویسی گسترش بدم و همین هم باعث شد تا زبان های برنامه نویسی دیگه رو هم یاد بگیرم. الان تقریبا جاوا توی هیچ قسمت از نیاز سنجی کار من نیست.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "d8f7295a",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "پیشگفتار",
                "id": "ac5d4919",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "بین زبان های برنامه نویسی ، ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "هیچ زبانی نمیتونه جای جاوا رو بگیره",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": ". شاید زبان های برنامه نویسی بهتری نسبت به جاوا از نظر املا یا سرعت یا مصرف منابع باشه ، اما دیگه خیلی چیزا جاواست و با اون کار میکنه و منطقی نیست اون نرم افزار ها رو به یه زبان دیگه باز نویسی کنن.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "اما از یک طرف دیگه ، ا",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "گر قرار هست کدی ایجاد کنیم ،میتونیم سراغ یک زبان دیگه بریم و جاوا تنها انتخاب یا حتی بهترین انتخاب نیست.",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            }
                        ]
                    }
                ],
                "id": "e8be8005",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "چرا بیس شد جاوا",
                "id": "b9af6e45",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "زمان زیادی نگذشت تا جاوا رو انتخاب کنم. برای برنامه نویس اندروید شدن ، اون هم توی دوران سال 93 که میشد 2014 تقریبا بهترین گزینه یا native اندروید جاوا بود و خاطرم هست با نرم افزاری به اسم eclipse اتفاق میوفتاد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "بعد ها علاقه ی من به ابعاد دیگه برنامه نویسی بیشتر شد. نمیشد نیاز به برنامه نویسی وب رو نادیده بگیرم اما اونقدر غرق داستان وب سرور ها شدم که بین زبان های برنامه نویسی بیشتر با node js کار میکردم تا با جاوا.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "جاوا املای کاملی داره. شی گراترین زبان برنامه نویسی هست و بازار شغلی اون تقریبا در همه جای دنیا تضمین میشه.اما جاوا جایی توی دنیای فرانت نتونست پیدا کنه و نه اپلت هاش به جایی رسیدن و نه اپلیکیشن های دسکتاپش.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "از یه طرف همون برنامه نویسی اندروید هم با کاتلین و بعد ها کراس پلتفرم هایی مثل vue native و react native و بعد از اونها هم flutter دیگه برنامه نویسی اندروید با جاوا رو کمرنگ تر کرد اگرچه هنوز هم رسما native اندروید جاواست.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "d2905472",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "چرا node js",
                "id": "eeb9cd07",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "جاوا تقریبا توی دنیای فرانت نتونست اونطوری باشه که توی دنیای وب سرور ها backend و نرم افزار های ویژه توسعه ی backend هست. اما وقتی که node js که با اون جاوااسکریپتی که توی دنیا فرانت بود وارد دنیای backend ها شد ، نتیجه ی خوبی گرفت.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "من خودم طرفدار برنامه نویسی جاوااسکریپت نیستم. و احساس میکنم جاوااسکریپت خام نمیتونه اون توسعه پذیری جاوا رو داشته باشه. بخاطر همین هست که از typescript استفاده میکنم و این زبان هم اونقدر موفق بوده که بتونه حفره های جاوااسکریپت رو پر کنه و کد جاوااسکریپت با کیفیت تولید کنه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "قالب json که تقریبا xml رو منسوخ کرد ، بومی جاوااسکریپت هست. شما برای خوندن یا نوشتن json توی برای مثال زبان جاوا ، باید از یک کتابخونه مثل jackson یا simple json یا gson و ... استفاده کنید. توی سیستم node.js و جاوااسکریپت همان قالب رو استفاده میکنید و نیازی به واسطه نیست. اگر از تایپ اسکریپ هم که استفاده کنید خوشبخت روزگارید چون با interface و type و خیلی دیگه از امکان دیگه میتونید کد های راحت تری بزنید.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "be3d233c",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "جامعه ی آماری",
                "id": "36e0a3e8",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "مجموع کتابخانه هایی که برای جاوااسکریپت نوشته شده از مجموع کتابخانه های باقی زبان های برنامه نویسی بیشتر هست. البته اکثر این کتابخانه ها برای کمتر کردن سختی کار برنامه نویسی با جاوااسکریپت ساخته شده ولی جای انتخاب بقیه رو هم پرکرده برای مثال خارج از جاوااسکریپت چه کتابخانه ای میتونه با react رقابت کنه؟",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "اولین جمله کتاب آموزش برنامه نویسی ditel and ditel این بود :",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": " به جاوا خوش آمدید پرطرفدار ترین زبان برنامه نویسی دنیا!",
                                "style": {
                                    "weight": ["ITALIC", "BOLD"]
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "الان دیگه جاوا اول نیست البته که بگم ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "جاوا جزو زبان های برنامه نویسی جاودانه هست",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": ". ولی جامعه آماری سمت جاوااسکریپت کار ها رفته و منابع زیادی هم برای آموزش و پرسش و پاسخ براش وجود داره.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "af6ccd9c",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "نتیجه گیری",
                "id": "2d36095c",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "این نکته رو بارها و بارها توی این نوشته تکرار کردم و اینجا هم میگم ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "جاوا هنوز هم زبان برنامه نویسی بسیار بزرگی هست اما جایی در دنیای فرانت نداره.",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "اینکه چرا من به سمت node,js رفتم انتخاب شخصی بود و معیار های من برای نیاز همه صدق نمیکنه. بازار کار جاوا در مقایسه با nodejs همچنان برتر هست. اما وضعیت node.js هم خوب هست. ولی وقتی وارد دنیای فرانت بشیم. اوضاع متفاوت خواهد بود.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "0bea43b0",
                "type": "caption"
            }
        ],
        "author": 1,
        "createAt": "1677786502027",
        "tag": [],
        "photo": "a6e3be5cac1d2026d51858a5517f7668.jpeg",
        "category": "6f55af0fceabffd5"
    },
    {
        "_id": {
            "$oid": "6400fe071ffd7ad6cb625538"
        },
        "id": "825301a315c7c733",
        "title": "redis پایگاه داده روی رم",
        "content": [
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "توی یک سیستم معمولی وقتی یه داده هایی هر لحظه در حال تغییر هست ، برنامه نویس میاد و اون رو توی قالب متغیر ها و با سبک های مختلف برنامه نویسی روی ram قرار میده. گاهی اونقدر که از پایگاه داده هم بزرگتر میشه.redis واجب هر سیستمی نیست ولی نمیشه ازش چشم پوشی کرد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "ad289808",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "پیشگفتار",
                "id": "5bc7887a",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "پایگاه داده واجب هر سیستمی هست. از یک طرف چه بخوایم چه نخوایم ، پاشنه آشیل یک سیستم پایگاه داده هاش هست.اگه از جنبه امنیتی خیال توسعه دهنده راحت باشه ، چون پایگاه های داده روی حافظه جانبی استقرار دارن پس باید تا حد امکان استفاده از پایگاه داده رو کم کرد چون حتی اگر از ssd هم استفاده کنیم نمیتونه پا به پای شبکه و ram و درنهایت cpu بیاد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "6b5e4910",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "cache",
                "id": "c7dcba2d",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "توی علم کامپیوتر ، یک اصطلاح یا مبحث وجود داره به اسم cache. درواقع cache یجور حافظه هست که داده هایی موقتا اونجا قراره بمونن و بعد از یه مدتی هم پاک میشن.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "توی کامپیوتر حافظه ی ram نقش cache برای کل سیستم رو بازی میکنه. جایی که داده های پر استفاده اونجا میان و دخیره میشن و بعد از یه مدتی هم پاک میشن.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "توی پردازشگر کامپیوتر یا همون CPU هم سه لایه حافظه cache وجود داره که به cache L1 , L2 , L3 تقسیم میشن.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "توی برنامه نویسی متغیر ها یا اشیا و یا بسته به اصطلاح هرزبان دیگه ای متغیر تعریف میشه هم نقش یک cache رو داره که ممکنه براساس ساختار بعدها از بین بره. و یا static بشه و در تمام طول اجرای برنامه همراه با برنامه بمونه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "2278acb5",
                "type": "caption"
            }
        ],
        "author": 1,
        "createAt": "1677786631115",
        "tag": [],
        "photo": "861a86c2aa72823936c3ee3c7b5d63aa.png",
        "category": "6f55af0fceabffd5"
    },
    {
        "_id": {
            "$oid": "640100211ffd7ad6cb62553a"
        },
        "id": "e62b53a1e6002618",
        "title": "json schema چیست",
        "content": [
            {
                "header": "h3",
                "text": "پیشگفتار",
                "id": "bc84a794",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "اکثر فریم ورک های برنامه نویسی وب ، ویژگی validation form رو دارن که میاد داده هایی که کاربر قرار هست برای سرور بفرسته رو اعتبارسنجی میکنه. اما یک قالب عمومی برای json هست که قالب یک json رو با یک json دیگه توصیف میکنیم. اینجا میخام درباره ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "json schema",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            },
                            {
                                "text": " صحبت کنم.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "5b77b214",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "backend یا frontend",
                "id": "ad19bbc2",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "یکی از ویژگی های خیلی منحصربفرد node.js اینه که شما یک تیکه کد رو میتونید توی هر قسمتی از سیستمتون استفاده کنین. مثلا یک کد دارید که قرار هست داده هایی که کاربر میفرسته رو اعتبارسنجی کنه. همون کد رو بدون هیچ تغییری میتونید و هم تو frontend هم توی backend بذارید.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "قالب json بومی جاوااسکریپت هست و میتونید اونو توی کد ها و اسکریپت های js تعریف کنید. اما نمیشه برای اون چارچوبی تعیین کرد. هرچند که اگر کدتون typescript باشه میتونید برای مثال با interface یک object رو تعریف کنید اما این توصیف برای توسعه کار خودتون مفید هست و اصطلاحا برای syntax استفاده میشه و نمیشه بهش دید اعتبارسنجی داشت.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "از یک طرف برای اینکه یک قالب عمومی برای بقیه زبان ها وجود داشته باشه که بیاد به json نگاه کنه و متوجه شه که این قالب صحیح هست یا نه امکانی معرفی شد به اسم json schema که برای object های json یک json دیگه میسازید که قالب رو توصیف کنه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "2755ad9b",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "تعریف",
                "id": "5331535b",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "یک json از کلید ها و مقدار ها یا key و value تشکیل میشه. عموما کلید ها string هستن و رایج هم همینه ولی میتونن از نوع های دیگه باشن. ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "ذهنیت ما همون قالب عمومی یا string بمونه بهتره",
                                "style": {
                                    "weight": ["ITALIC"]
                                }
                            },
                            {
                                "text": ".",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "مقادیر یا value ها میتونن از انواع رشته ، عددی ، منطقی یا boolean و یا آرایه باشن. با همین اوصاف میشه برای یک json قاعده تعریف کرد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "برای مثال قالب ما اینطوری باشه:یک object هست (همون کلید مقدار) که کلید مقادرش باید اینطور باشه که یک فیلد به اسم age از نوع عدد \"",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "میتونه",
                                "style": {
                                    "weight": ["UNDERLINE", "ITALIC"]
                                }
                            },
                            {
                                "text": "\"",
                                "style": {
                                    "weight": ["ITALIC"]
                                }
                            },
                            {
                                "text": " داشته باشه. یک فیلد هم به اسم id از نوع رشته ای ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "\"",
                                "style": {
                                    "weight": ["ITALIC"]
                                }
                            },
                            {
                                "text": "حتما\"",
                                "style": {
                                    "weight": ["UNDERLINE", "ITALIC"]
                                }
                            },
                            {
                                "text": " باید داشته باشه.چیزی جز اینها هم دیگه نداشته باشه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "توصیفش میشه این:",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "c87ff3f7",
                "type": "caption"
            },
            {
                "text": "{\n    \"type\": \"object\",\n    \"properties\": {\n      \"age\": { \"type\":\"number\", \"nullable\": true },\n      \"id\": { \"type\":\"string\" }\n    },\n    \"required\":[\"id\"],\n    \"additionalProperties\": false\n}\n",
                "id": "26fc3a4e",
                "type": "code"
            },
            {
                "header": "h3",
                "text": "مثال",
                "id": "d24f9271",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "یه جمله معروف از آلبرت انیشتین هست که میگه",
                                "style": {
                                    "weight": ["ITALIC"]
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "مثال بهترین راه آموزش نیست، تنها راه آموزش هست.",
                                "style": {
                                    "weight": ["ITALIC", "BOLD"]
                                }
                            }
                        ]
                    }
                ],
                "id": "66786692",
                "type": "frame"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "مثال بالا یک مثال ساده بود. حالا یک سناریوی کاملتر نسبت به قبلی رو اینجا تعریف میکنم. فرض کنید وب سروری هست که داده هایی رو از فرانت دریافت میکنه و برای ذخیره توی پایگاه داده هاش میاد و این داده ها رو بررسی میکنه که آیا معتبر هست یا نه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "داده ای که میگیره باید این خصوصیات رو داشته باشه. یک json هست که کلیدهایی داره. ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "کلید شماره یک",
                                "style": {
                                    "weight": ["UNDERLINE"]
                                }
                            },
                            {
                                "text": " اسمش ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "id",
                                "style": {
                                    "weight": ["ITALIC", "BOLD"]
                                }
                            },
                            {
                                "text": " هستش که باید string باشه اجباری هم هست. ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "کلید شماره 2",
                                "style": {
                                    "weight": ["UNDERLINE"]
                                }
                            },
                            {
                                "text": " اسمش ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "name",
                                "style": {
                                    "weight": ["ITALIC", "BOLD"]
                                }
                            },
                            {
                                "text": " هست، اجباریه و باید از نوع string باشه. ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "کلید شماره 3",
                                "style": {
                                    "weight": ["UNDERLINE"]
                                }
                            },
                            {
                                "text": " اسمش ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "address",
                                "style": {
                                    "weight": ["ITALIC", "BOLD"]
                                }
                            },
                            {
                                "text": " هست که یک آرایه هست. اعضای این آرایه باید اینطوری باشن که یک json باشن با کلید های city از نوع string که اجباریه و street که اختیاری نیست ,و اونم از نوع string هستش. جز این ها هم نباید چیز اضافی داشته باشه. ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "کلید شماره 4",
                                "style": {
                                    "weight": ["UNDERLINE"]
                                }
                            },
                            {
                                "text": " اسمش married هست (",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "چیز دیگه به ذهنم نرسید) ",
                                "style": {
                                    "weight": ["ITALIC"]
                                }
                            },
                            {
                                "text": "که از نوع منطقی یا boolean باید باشه و ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "کلید شماره 5",
                                "style": {
                                    "weight": ["UNDERLINE"]
                                }
                            },
                            {
                                "text": " هم اسمش age هست که از نوع عدد هست.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "این یک مثال از توصیف های ما هست که شرایط ما رو احراز میکنه:",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "f0fa4379",
                "type": "caption"
            },
            {
                "text": "{\n    \"id\": \"ae450-16220-b405a\",\n    \"name\": \"farhang\",\n    \"address\": [\n      {\n        \"city\": \"tehran\",\n        \"street\": \"jannat abad\"\n      }\n    ],\n    \"married\": false,\n    \"age\": 27\n}\n",
                "id": "9f858b8b",
                "type": "code"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "همین سناریو رو برای وب سرورمون با json schema توصیفش میکنیم. کدی که این شرایط رو توصیف میکنه این شکلی هست:",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "bcb9fe0e",
                "type": "caption"
            },
            {
                "text": "{\n    \"type\": \"object\",\n    \"properties\": {\n      \n      \"id\": { \"type\": \"string\"},\n      \"name\": { \"type\": \"string\"},\n      \"married\": { \"type\": \"string\", \"nullable\": true},\n      \"age\": { \"type\": \"boolean\", \"nullable\": true},\n\n      \"address\": {\n        \"type\": \"array\",\n        \"items\": {\n          \"type\": \"object\",\n          \"properties\": {\n            \"city\":{ \"type\":\"string\" },\n            \"street\":{ \"type\":\"string\" }\n          },\n          \"addtionalProperties\": false,\n          \"required\":[\"city\",\"street\"]\n        }\n      }\n\n    },\n    \"addtionalProperties\": false,\n    \"required\":[\"id\",\"name\",\"address\"]\n  }\n",
                "id": "a2d00c4e",
                "type": "code"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "شاید احتیاج بدونید توضیح بدم ، اما بحث json schema خیلی عمیق تر از این صحبت ها هست و کلی داکیومنت گسترده براش وجود داره. جاهایی که مثلا یک کلید از دو نوع باشه یا اگر از یک نوع بود بقیه الگو کلا یه شکل دیگه باشه. یا مسایل دیگه. ولی فعلا تا اینجا بهترین ابزار توصیف json بحساب میاد و میشه باهاش برای json الگو تعیین کرد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "برای node js که من کار میکنم بهترین کتابخونه براش ، ajv هست که هم میتونید توی frontend هم توی backend داشته باشید.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "11e3b4ad",
                "type": "caption"
            }
        ],
        "author": 1,
        "createAt": "1677787169309",
        "tag": [],
        "photo": "15523e15076a599191af1fbe2c21877c.png",
        "category": "6f55af0fceabffd5"
    },
    {
        "_id": {
            "$oid": "64022d011c483d98b36bb409"
        },
        "id": "299d4c591a9bb041",
        "title": "انسداد",
        "content": [
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "یه دوره ای که مدرسه نمیرفتیم ، جمله ای که تابحال نشنیده بودیم فکر میکردیم فحش هست و نثار هم میکردیم. مثلا خیلی خرسندی. خیلی آدمِ خشنودی هستی. خیلی مشتاقی ...",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "25df3d84",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "پیشگفتار",
                "id": "cdbceeff",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "تقریبا میشه گقت 90 درصد سبک زندگی ما در کشور امریکا ابداع شده.از بدترین اختراع بشر که بمب اتم باشه تا مسایلی مثل اومدن برق به خانه های مردم و بعدش هم اینترنت . الانم نمیخام سیاسی حرف بزنم یا از اون کشور تعریف یا انتقاد کنم ولی این واقعیته.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "اینکه یک تلکنولوژی جدیدی معرفی میشه و دسترس همه میاد ، پیشفرض چیز بدی هست اما زمان ثابت میکنه که آیا خوب بوده یا بد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "adc79636",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "داستان angry birds",
                "id": "1571b1cf",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "سال 92 شمسی (حدودا 2013) که ما هنرستان بودیم یه بازی جدید توی سایت های کامپیوتری مدرسه مد شده بود. اونم چنتا پرنده رو از روی یه وسیله ای پرتاب میشدن که چنتا قفس رو بشکونن. نکته ی جذابی نداشت ولی خب نمیدونم چرا از در و دیوار دربارش صحبت میکردن.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "از روش انیمیشن درست کردن و کلی هم دفتر و کتاب از کنارش دراومد. تیشرت هاش رو تن مردم میدیدم یا قاب گوشی...",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "آخرش در اومد جاسوس افزار بوده و البته این خبر اونقدر کسیو ناراحت نکرد ولی خب رفته رفته از رده خارج شد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "اگر توی زمان اوجش میگفتید که این چیز بدیه در بهترین حالت ، احتمالا مردم شما رو زیاد تحویل نمیگرفتن ولی زمان ثابت کرد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "427043de",
                "type": "caption"
            },
            {
                "richtext": [],
                "url": "http://localhost:31375/photo/51f31606ae9c881b1d7bd930628895ce.jpeg",
                "id": "55e2fe38",
                "type": "photo"
            },
            {
                "header": "h3",
                "text": "تماس تصویری MMS",
                "id": "ff397291",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "همون سالهای angry birds بود ینی سال های اوایل دهه نود که دوقطبی همراه اول و ایرانسل بود که یک شرکت جدید به اسم رایتل سروکلش پیدا شد و گفت که نسل سوم ارتباط همراه یا 3G رو ارایه میده. بین امکانات اون نسل از ارتباطات علاوه بر اینترنت با سرعت بالا ، تماس تصویری یا MMS هم پیداش شد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "جایی که بحای SMS بازی ها که متن خالی بود و ذوق رفقا از جملات عارفانه تا جک های ختم خفن رو شامل میشد دیگه اینبار مدیا هم وسط میومد.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "داخل کشور یه سری نیرو ها بودن که گفتن باید همین الان از نطفه قطع کرد و رواج فحشا میشه اینکه یه زنی بتونه با یه مردی تصویری صحبت کنه. جوری که مارو تربیت کرده بودن و به تربیت خودشون شک داشتن.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "امکان MMS مسدود شد ولی دنیا به مسیر خودش بدون ما ادامه داد. الان جایی هستیم که میگه ببین این پیامرسان ایرانی ماست که تماس تصویری داره ولی خریدارش بین مردم دیگه خیلی کم شده.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "7ffe8dcb",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "داستان tik tok",
                "id": "8d11b240",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "من خودم اکانت اینستاگرام ندارم و از محیطش واقعا خوشم نمیاد. بدون قضاوت اما با یک مثال ؛ جایی که یه دختری جوان با تراشیدن موی زیربغلش یا کارها و حرفای عجیب دیگه در مقیاس میلیون ها نفر رو دنبال کننده خودش کرد و اونقدری دیده شد که تبدیل به یک نماد از کشور ایران به عنوان ستاره های اینترنت شد!",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "ویژگی اینستاگرام اینه که ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "یک پیج در این سیستم ، پتانسیل اینو داره به چنان ارزشی برسه که درآمدش گاها با یک میدان نفتی برابری کنه یا چندین برابر کارخانه ها و صنایع سنگین و فوق سنگین یا حیاتی پول ساز باشه.",
                                "style": {
                                    "weight": ["BOLD"]
                                }
                            }
                        ]
                    }
                ],
                "id": "1d154247",
                "type": "caption"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "حسین میرزایی ، نماینده اصفهان در مجلس که از مدافعان طرح صیانت فضای مجازی بحساب میان ، صحبتی کردن که اینستاگرام قطعا از بازار ایران رویگردان نخواهد شد چون نمیتونه ضربه کنار گذاشته شدن توسط کاربران ایرانی رو تحمل کنه...",
                                "style": {
                                    "weight": ["BOLD", "ITALIC"]
                                }
                            }
                        ]
                    }
                ],
                "url": "http://localhost:31375/photo/6ecd3f59c5b99cec2e89b5b253ed6872.jpeg",
                "id": "f02a2349",
                "type": "photo"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "از اینستاگرام ، اینستاگرام تر، اپلیکیشن tik tok هست و تونست به عنوان پرطرفدارترین آدرس اینترنتی سال 2021 بشه و سلطه گوگل رو تمام کنه.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "پیج تیک تاک هم ارزش زیادی داره. پتانسیل گذاشتن تبلیغات رو توی ساختارش داره و گرافیکش یک استاندارد جدید و منحصر به فرد و کنایه آمیزی داره.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    },
                    {
                        "content": [
                            {
                                "text": "این اپ که ساخت کشور چین هم هست ورود هرگونه ایرانی رو به داخلش ممنوع کرده ",
                                "style": {
                                    "weight": []
                                }
                            },
                            {
                                "text": "(حالا به هر دلیل) ",
                                "style": {
                                    "weight": ["ITALIC"]
                                }
                            },
                            {
                                "text": "و در پرطرفدارترین دامنه اینترنتی خبری از ایران نیست...",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "93c6ba2b",
                "type": "caption"
            },
            {
                "header": "h3",
                "text": "نتیجه گیری",
                "id": "cb1a4b08",
                "type": "title"
            },
            {
                "richtext": [
                    {
                        "content": [
                            {
                                "text": "من دقیقا نمیدونم که چی درسته چی غلط ولی یه سری مسایل اینقدر برجسته و آشکار هست که نیازی به بینش خاصی نداره. دنیا طوری ساخته نشده که ما بتونیم به گروگان بگیریمش حتی به نفت ما هم احتیاجی نیست. مساله اینه که 2+2 همیشه برابر با 4 هست و باید براساس قاعده رفتار کرد و با مشت و لگد نمیشه برنده بازی شطرنج شد و انسداد هم راه پالایش نیست.",
                                "style": {
                                    "weight": []
                                }
                            }
                        ]
                    }
                ],
                "id": "1836b242",
                "type": "caption"
            }
        ],
        "author": 1,
        "createAt": "1677864193708",
        "tag": ["انتقاد", "دوستانه"],
        "category": "5e7552aacbbe3ec5",
        "photo": "bdc319379629c718db6d8c98527ce982.jpeg"
    }
]
